In [5]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [6]:
data = pd.read_csv('UCI_Credit_Card.csv')

In [7]:
data.head()

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default.payment.next.month
0,1,20000.0,2,2,1,24,2,2,-1,-1,...,0.0,0.0,0.0,0.0,689.0,0.0,0.0,0.0,0.0,1
1,2,120000.0,2,2,2,26,-1,2,0,0,...,3272.0,3455.0,3261.0,0.0,1000.0,1000.0,1000.0,0.0,2000.0,1
2,3,90000.0,2,2,2,34,0,0,0,0,...,14331.0,14948.0,15549.0,1518.0,1500.0,1000.0,1000.0,1000.0,5000.0,0
3,4,50000.0,2,2,1,37,0,0,0,0,...,28314.0,28959.0,29547.0,2000.0,2019.0,1200.0,1100.0,1069.0,1000.0,0
4,5,50000.0,1,2,1,57,-1,0,-1,0,...,20940.0,19146.0,19131.0,2000.0,36681.0,10000.0,9000.0,689.0,679.0,0

In [ ]:
data.columns

In [ ]:
#data.index

In [ ]:
# data.info()

In [ ]:
# data.describe().transpose()

In [ ]:
type(data['LIMIT_BAL'])

# data = data.rename(columns = {'PAY_0' : 'PAY_1'})

In [ ]:
data

In [ ]:
# pay_cols = ['PAY_0','PAY_2', 'PAY_3', 'PAY_4', 'PAY_5', 'PAY_6']
# data[pay_cols]

In [ ]:
# make a new column for the unpaid amount 

# data['UNPAID_Aug']= data['BILL_AMT2']- data['PAY_AMT1']
# data['UNPAID_Jul']= data['BILL_AMT3']- data['PAY_AMT2']
# data['UNPAID_Jun']= data['BILL_AMT4']- data['PAY_AMT3']
# data['UNPAID_May']= data['BILL_AMT5']- data['PAY_AMT4']
# data['UNPAID_Apr']= data['BILL_AMT6']- data['PAY_AMT5']

In [ ]:
data

In [ ]:
data.describe()

In [ ]:
#if want to drop anything 
#data.drop

In [8]:
df = data

In [9]:
df

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default.payment.next.month
0,1,20000.0,2,2,1,24,2,2,-1,-1,...,0.0,0.0,0.0,0.0,689.0,0.0,0.0,0.0,0.0,1
1,2,120000.0,2,2,2,26,-1,2,0,0,...,3272.0,3455.0,3261.0,0.0,1000.0,1000.0,1000.0,0.0,2000.0,1
2,3,90000.0,2,2,2,34,0,0,0,0,...,14331.0,14948.0,15549.0,1518.0,1500.0,1000.0,1000.0,1000.0,5000.0,0
3,4,50000.0,2,2,1,37,0,0,0,0,...,28314.0,28959.0,29547.0,2000.0,2019.0,1200.0,1100.0,1069.0,1000.0,0
4,5,50000.0,1,2,1,57,-1,0,-1,0,...,20940.0,19146.0,19131.0,2000.0,36681.0,10000.0,9000.0,689.0,679.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29995,29996,220000.0,1,3,1,39,0,0,0,0,...,88004.0,31237.0,15980.0,8500.0,20000.0,5003.0,3047.0,5000.0,1000.0,0
29996,29997,150000.0,1,3,2,43,-1,-1,-1,-1,...,8979.0,5190.0,0.0,1837.0,3526.0,8998.0,129.0,0.0,0.0,0
29997,29998,30000.0,1,2,2,37,4,3,2,-1,...,20878.0,20582.0,19357.0,0.0,0.0,22000.0,4200.0,2000.0,3100.0,1
29998,29999,80000.0,1,3,1,41,1,-1,0,0,...,52774.0,11855.0,48944.0,85900.0,3409.0,1178.0,1926.0,52964.0,1804.0,1
29999,30000,50000.0,1,2,1,46,0,0,0,0,...,36535.0,32428.0,15313.0,2078.0,1800.0,1430.0,1000.0,1000.0,1000.0,1

In [ ]:
#when for eda you need a column as an index

In [ ]:
 df = df.set_index('ID')
# df.reset_index()

In [ ]:
df.head()

In [ ]:
# grabing a row
 # df.iloc[4] #5th row using index (i)
 # df.loc[4] # 4th row    
# df.loc[0:3]

In [ ]:
# extra_row = df.iloc[0]
# df.append(extra_row)

In [ ]:
#df.drop(1)

In [ ]:
df

In [ ]:
#Filtering 
# and - df[(df['SEX']== 2) & (df['EDUCATION']== 2)]

In [ ]:
# or-  df[(df['SEX']== 2) | (df['EDUCATION']== 2)]

In [ ]:
edu_options = [1,2,3]
df[df['EDUCATION'].isin(edu_options)]

In [ ]:
 #Apply(funtions)
# def simple (num):
#     return num*2

In [ ]:
simple(2)

In [ ]:
#df['double_age'] = df['AGE'].apply(simple)

In [ ]:
df

In [ ]:
lambda num: num*2

In [ ]:
df['double_limit'] = df['LIMIT_BAL'].apply(lambda num: num*2)

In [ ]:
df

In [ ]:
# def quality(SEX,EDUCATION):
    
#     if SEX + EDUCATION > 2: # this is the argument ,write 
#         # any mathematical terms where you need multiple 
#         #item 
#         return 'ok'
#     else:
#         return 'not ok'

In [ ]:
# df['check'] = df[['SEX','EDUCATION']].apply( lambda df:quality(df['SEX'],df['EDUCATION']),axis =1)

In [ ]:
#easir way 

# df['check2'] = np.vectorize(quality)(df['SEX'],df['EDUCATION'])

In [ ]:
# df.sort_values('LIMIT_BAL')

In [ ]:
# df.sort_values(['LIMIT_BAL','MARRIAGE'])

In [ ]:
df['LIMIT_BAL'].max()

In [ ]:
df['LIMIT_BAL'].idxmax() # index value of min and max

In [ ]:
df = df.drop(['double_age','double_limit'],axis = 1)

In [ ]:
# df.corr()

In [ ]:
df['SEX'].value_counts()

In [ ]:
df['EDUCATION'].unique()

In [ ]:
# replace 
# df['SEX'].replace(['2','3'],['not much','grad'])

In [ ]:
#mymap = {'2':'not much','3':'grad'}

In [ ]:
 #df['SEX'].map(mymap)# is used inp;ace for replace

In [ ]:
df.duplicated()

In [ ]:
#what_are = df.drop_duplicates()

In [ ]:
# df.nlargest(2,'LIMIT_BAL') / nsmallest
# the belwo will give the same reult

In [ ]:
# df.sort_values('LIMIT_BAL',ascending=False).iloc[0:2]

In [ ]:
# df.sample(5)
# df.sample(frac = 0.1) give the sample 10 percent of the pop

In [ ]:
# missing data
# df.isnull()
# df[df['SEX'].notnull()]

In [ ]:
# df.notnull().count()

In [ ]:
#df.dropna(thresh=1) drop any drop which contains nun values
# atleast they have 1 non null value

In [ ]:
# df.dropna(axis=1), # if any column will have 1 single values it 
# will drop full column

In [ ]:
# df.dropna(subset=[LIMIT_BAL])

In [ ]:
# Fill NA

In [ ]:
# df['LIMIT_BAL']= df['LIMIT_BAL'].fillna(df['LIMIT_BAL'].mean())

In [ ]:
airline_txt = {'first':100,'business':np.nan,'economy-plus':50,'economy':30}

In [ ]:
ser = pd.Series(airline_txt)

In [ ]:
ser

In [ ]:
ser.fillna(ser[airline_txt].mean())

In [ ]:
ser.interpolate() # it will lies between 100 amd 50 the 
# the before and after vlaues

In [ ]:
# group by operations

In [ ]:
# on caterogical columns

In [ ]:
df['EDUCATION'].unique()

In [ ]:
df.groupby('EDUCATION') # lazy it needs aggregate call

In [ ]:
df.groupby('EDUCATION').mean()

In [ ]:
df.groupby('EDUCATION').mean()['LIMIT_BAL']

In [ ]:
df.groupby(['EDUCATION','SEX']).mean()['LIMIT_BAL']

In [ ]:
df.groupby(['EDUCATION','SEX','MARRIAGE']).mean().index
# Multi index

In [ ]:
df.groupby('EDUCATION').describe()

In [ ]:
limit_bal = df.groupby(['EDUCATION','SEX']).mean()

In [ ]:
limit_bal2 = df.groupby(['SEX','MARRIAGE']).mean()

In [ ]:
limit_bal.index.names

In [ ]:
limit_bal.index.levels

In [ ]:
limit_bal.loc[[0,4]]# will work on the outside of level index

In [ ]:
# limit_bal.index # it gives tuples

In [ ]:
# limit_bal.loc[(4,2)]

In [ ]:
limit_bal2 = df.groupby(['SEX','MARRIAGE']).mean()

In [ ]:
limit_bal2.loc[:]

In [ ]:
limit_bal2.xs(key = 1,level = 'SEX' )

In [ ]:
two_marriage = limit_bal2.xs(key = 2,level = 'MARRIAGE' ) # Marriage of both 
#sex 1 & 2 but you can call only 1 element from inner index
#so first get from the data and then apply group by 
# on cell below

In [ ]:
two_marriage

In [ ]:
df[df['MARRIAGE'].isin([2,3])].groupby(['SEX','MARRIAGE']).mean()

In [ ]:
# to swap level

In [ ]:
swapped_limit = limit_bal2.swaplevel()

In [ ]:
swapped_limit.sort_index(level='MARRIAGE',ascending = False)

In [ ]:
swapped_limit.sort_index(level='SEX',ascending = False)

In [ ]:
df

In [ ]:
df.agg(['std','mean'])[['LIMIT_BAL','BILL_AMT4']]

In [10]:
df.agg({'LIMIT_BAL':['max','mean'],'BILL_AMT1':['mean','std']})

           LIMIT_BAL     BILL_AMT1
max   1000000.000000           NaN
mean   167484.322667  51223.330900
std              NaN  73635.860576

In [ ]:
# import pandas as pd 
# from jupyter_datatables import init_datatables_mode

In [ ]:
# pip install jupyter_datatables

In [4]:
# import pandas as pd 
# from jupyter_datatables import init_datatables_mode

In [6]:
# %load_ext jupyter_require
# init_datatables_mode()

In [8]:
# df = pd.read_csv('UCI_Credit_Card.csv')

In [13]:
df['LIMIT_BAL'].rename('LIMIT_BALANCE')

0         20000.0
1        120000.0
2         90000.0
3         50000.0
4         50000.0
           ...
29995    220000.0
29996    150000.0
29997     30000.0
29998     80000.0
29999     50000.0
Name: LIMIT_BALANCE, Length: 30000, dtype: float64

In [15]:
df

,ID,LIMIT_BAL,SEX,EDUCATION,MARRIAGE,AGE,PAY_0,PAY_2,PAY_3,PAY_4,...,BILL_AMT4,BILL_AMT5,BILL_AMT6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default.payment.next.month
0,1,20000.0,2,2,1,24,2,2,-1,-1,...,0.0,0.0,0.0,0.0,689.0,0.0,0.0,0.0,0.0,1
1,2,120000.0,2,2,2,26,-1,2,0,0,...,3272.0,3455.0,3261.0,0.0,1000.0,1000.0,1000.0,0.0,2000.0,1
2,3,90000.0,2,2,2,34,0,0,0,0,...,14331.0,14948.0,15549.0,1518.0,1500.0,1000.0,1000.0,1000.0,5000.0,0
3,4,50000.0,2,2,1,37,0,0,0,0,...,28314.0,28959.0,29547.0,2000.0,2019.0,1200.0,1100.0,1069.0,1000.0,0
4,5,50000.0,1,2,1,57,-1,0,-1,0,...,20940.0,19146.0,19131.0,2000.0,36681.0,10000.0,9000.0,689.0,679.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
29995,29996,220000.0,1,3,1,39,0,0,0,0,...,88004.0,31237.0,15980.0,8500.0,20000.0,5003.0,3047.0,5000.0,1000.0,0
29996,29997,150000.0,1,3,2,43,-1,-1,-1,-1,...,8979.0,5190.0,0.0,1837.0,3526.0,8998.0,129.0,0.0,0.0,0
29997,29998,30000.0,1,2,2,37,4,3,2,-1,...,20878.0,20582.0,19357.0,0.0,0.0,22000.0,4200.0,2000.0,3100.0,1
29998,29999,80000.0,1,3,1,41,1,-1,0,0,...,52774.0,11855.0,48944.0,85900.0,3409.0,1178.0,1926.0,52964.0,1804.0,1
29999,30000,50000.0,1,2,1,46,0,0,0,0,...,36535.0,32428.0,15313.0,2078.0,1800.0,1430.0,1000.0,1000.0,1000.0,1

In [16]:
email = 'ibtesam@gmail.com'

In [24]:
names = pd.Series(['a','b','7','d'])

In [25]:
names

0    a
1    b
2    7
3    d
dtype: object

In [26]:
# names.str.upper()

In [28]:
names.str.isdigit()

0    False
1    False
2     True
3    False
dtype: bool

In [20]:
email.isdigit()

False

In [22]:
'5'.isdigit()

True

In [29]:
tech_finace = ['appl,google,jsco','hash,sfgd,tiny']

In [30]:
tickers = pd.Series(tech_finace)

In [31]:
tickers.str.split(',',expand = True)

      0       1     2
0  appl  google  jsco
1  hash    sfgd  tiny

In [32]:
messy_names = pd.Series(['andres  ','bo:;bo', '  clair'])

In [33]:
messy_names

0    andres
1      bo:;bo
2       clair
dtype: object

In [35]:
messy_names.str.replace(':;','')

0    andres
1        bobo
2       clair
dtype: object

In [36]:
messy_names.str.replace(':;','').str.strip().str.capitalize()

0    Andres
1      Bobo
2     Clair
dtype: object

In [39]:
def cleanup(name):
    name = name.replace(':;','')
    name = name.strip()
    name = name.capitalize()
    return name

In [40]:
messy_names.apply(cleanup)

0    Andres
1      Bobo
2     Clair
dtype: object

In [41]:
np.vectorize(cleanup)(messy_names)

array(['Andres', 'Bobo', 'Clair'], dtype='<U6')

Datetime -

In [43]:
from datetime import datetime

In [45]:
yyear = 2019
ymonth = 1
yday = 1
yhour = 2
ymin = 30
ysec = 30

In [46]:
mydatetime = datetime(yyear,ymonth,yday,yhour,ymin,ysec)

In [47]:
mydatetime

datetime.datetime(2019, 1, 1, 2, 30, 30)

In [48]:
mydatetime.year

2019

In [54]:
# Pandas Pivot Tables 

dt = df[['LIMIT_BAL','EDUCATION','MARRIAGE']]

In [56]:
dt

       LIMIT_BAL  EDUCATION  MARRIAGE
0        20000.0          2         1
1       120000.0          2         2
2        90000.0          2         2
3        50000.0          2         1
4        50000.0          2         1
...          ...        ...       ...
29995   220000.0          3         1
29996   150000.0          3         2
29997    30000.0          2         2
29998    80000.0          3         1
29999    50000.0          2         1

[30000 rows x 3 columns]

In [57]:
# pd.pivot(data = dt, columns = 'MARRIAGE', values='LIMIT_BAL')

MARRIAGE   0         1         2   3
0        NaN   20000.0       NaN NaN
1        NaN       NaN  120000.0 NaN
2        NaN       NaN   90000.0 NaN
3        NaN   50000.0       NaN NaN
4        NaN   50000.0       NaN NaN
...       ..       ...       ...  ..
29995    NaN  220000.0       NaN NaN
29996    NaN       NaN  150000.0 NaN
29997    NaN       NaN   30000.0 NaN
29998    NaN   80000.0       NaN NaN
29999    NaN   50000.0       NaN NaN

[30000 rows x 4 columns]

In [59]:
pd.pivot_table(df,index = 'SEX',aggfunc='sum')

,AGE,BILL_AMT1,BILL_AMT2,BILL_AMT3,BILL_AMT4,BILL_AMT5,BILL_AMT6,EDUCATION,ID,LIMIT_BAL,...,PAY_4,PAY_5,PAY_6,PAY_AMT1,PAY_AMT2,PAY_AMT3,PAY_AMT4,PAY_AMT5,PAY_AMT6,default.payment.next.month
SEX,,,,,,,,,,,,,,,,,,,,,
1,434143,645292576.0,617207624.0,583887774.0,534963936.0,494392259.0,476729905.0,21865,175975331,1.943924e+09,...,-1591,-2249,-2718,67387571.0,70861041.0,64343872.0,57884788.0,57428872.0,62723427.0,2873
2,630422,891407351.0,858164631.0,826506870.0,762924533.0,714949770.0,689422907.0,33729,274039669,3.080606e+09,...,-5029,-5737,-6015,102519844.0,106773864.0,92426573.0,86897518.0,86552757.0,93741650.0,3763